{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v3.21.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "efficientnetv2-b0_input"}}, {"class_name": "Functional", "config": {"name": "efficientnetv2-b0", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "stem_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stem_conv", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stem_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stem_bn", "inbound_nodes": [[["stem_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stem_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "stem_activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1-01_project_conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1-01_project_conv", "inbound_nodes": [[["stem_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block1-01_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block1-01_project_bn", "inbound_nodes": [[["block1-01_project_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block1-01_project_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block1-01_project_activation", "inbound_nodes": [[["block1-01_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2-01_expand_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2-01_expand_conv", "inbound_nodes": [[["block1-01_project_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2-01_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2-01_expand_bn", "inbound_nodes": [[["block2-01_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2-01_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2-01_expand_activation", "inbound_nodes": [[["block2-01_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2-01_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2-01_project_conv", "inbound_nodes": [[["block2-01_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2-01_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2-01_project_bn", "inbound_nodes": [[["block2-01_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2-02_expand_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2-02_expand_conv", "inbound_nodes": [[["block2-01_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2-02_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2-02_expand_bn", "inbound_nodes": [[["block2-02_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block2-02_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block2-02_expand_activation", "inbound_nodes": [[["block2-02_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2-02_project_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2-02_project_conv", "inbound_nodes": [[["block2-02_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block2-02_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block2-02_project_bn", "inbound_nodes": [[["block2-02_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block2-02_drop", "trainable": false, "dtype": "float32", "rate": 0.01904761904761905, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block2-02_drop", "inbound_nodes": [[["block2-02_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block2-02_add", "trainable": false, "dtype": "float32"}, "name": "block2-02_add", "inbound_nodes": [[["block2-02_drop", 0, 0, {}], ["block2-01_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3-01_expand_conv", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3-01_expand_conv", "inbound_nodes": [[["block2-02_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3-01_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3-01_expand_bn", "inbound_nodes": [[["block3-01_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3-01_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3-01_expand_activation", "inbound_nodes": [[["block3-01_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3-01_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3-01_project_conv", "inbound_nodes": [[["block3-01_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3-01_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3-01_project_bn", "inbound_nodes": [[["block3-01_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3-02_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3-02_expand_conv", "inbound_nodes": [[["block3-01_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3-02_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3-02_expand_bn", "inbound_nodes": [[["block3-02_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block3-02_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block3-02_expand_activation", "inbound_nodes": [[["block3-02_expand_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3-02_project_conv", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3-02_project_conv", "inbound_nodes": [[["block3-02_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block3-02_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block3-02_project_bn", "inbound_nodes": [[["block3-02_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block3-02_drop", "trainable": false, "dtype": "float32", "rate": 0.0380952380952381, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block3-02_drop", "inbound_nodes": [[["block3-02_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block3-02_add", "trainable": false, "dtype": "float32"}, "name": "block3-02_add", "inbound_nodes": [[["block3-02_drop", 0, 0, {}], ["block3-01_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-01_expand_conv", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-01_expand_conv", "inbound_nodes": [[["block3-02_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-01_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-01_expand_bn", "inbound_nodes": [[["block4-01_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-01_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-01_expand_activation", "inbound_nodes": [[["block4-01_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4-01_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4-01_dwconv2", "inbound_nodes": [[["block4-01_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-01_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-01_bn", "inbound_nodes": [[["block4-01_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-01_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-01_activation", "inbound_nodes": [[["block4-01_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4-01_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4-01_se_squeeze", "inbound_nodes": [[["block4-01_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4-01_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 192]}, "name": "block4-01_se_reshape", "inbound_nodes": [[["block4-01_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-01_se_reduce", "trainable": false, "dtype": "float32", "filters": 12, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-01_se_reduce", "inbound_nodes": [[["block4-01_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-01_se_expand", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-01_se_expand", "inbound_nodes": [[["block4-01_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4-01_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4-01_se_excite", "inbound_nodes": [[["block4-01_activation", 0, 0, {}], ["block4-01_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-01_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-01_project_conv", "inbound_nodes": [[["block4-01_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-01_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-01_project_bn", "inbound_nodes": [[["block4-01_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-02_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-02_expand_conv", "inbound_nodes": [[["block4-01_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-02_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-02_expand_bn", "inbound_nodes": [[["block4-02_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-02_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-02_expand_activation", "inbound_nodes": [[["block4-02_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4-02_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4-02_dwconv2", "inbound_nodes": [[["block4-02_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-02_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-02_bn", "inbound_nodes": [[["block4-02_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-02_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-02_activation", "inbound_nodes": [[["block4-02_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4-02_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4-02_se_squeeze", "inbound_nodes": [[["block4-02_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4-02_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 384]}, "name": "block4-02_se_reshape", "inbound_nodes": [[["block4-02_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-02_se_reduce", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-02_se_reduce", "inbound_nodes": [[["block4-02_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-02_se_expand", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-02_se_expand", "inbound_nodes": [[["block4-02_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4-02_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4-02_se_excite", "inbound_nodes": [[["block4-02_activation", 0, 0, {}], ["block4-02_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-02_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-02_project_conv", "inbound_nodes": [[["block4-02_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-02_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-02_project_bn", "inbound_nodes": [[["block4-02_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block4-02_drop", "trainable": false, "dtype": "float32", "rate": 0.05714285714285715, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block4-02_drop", "inbound_nodes": [[["block4-02_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block4-02_add", "trainable": false, "dtype": "float32"}, "name": "block4-02_add", "inbound_nodes": [[["block4-02_drop", 0, 0, {}], ["block4-01_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-03_expand_conv", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-03_expand_conv", "inbound_nodes": [[["block4-02_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-03_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-03_expand_bn", "inbound_nodes": [[["block4-03_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-03_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-03_expand_activation", "inbound_nodes": [[["block4-03_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block4-03_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block4-03_dwconv2", "inbound_nodes": [[["block4-03_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-03_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-03_bn", "inbound_nodes": [[["block4-03_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block4-03_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block4-03_activation", "inbound_nodes": [[["block4-03_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block4-03_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block4-03_se_squeeze", "inbound_nodes": [[["block4-03_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block4-03_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 384]}, "name": "block4-03_se_reshape", "inbound_nodes": [[["block4-03_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-03_se_reduce", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-03_se_reduce", "inbound_nodes": [[["block4-03_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-03_se_expand", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-03_se_expand", "inbound_nodes": [[["block4-03_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block4-03_se_excite", "trainable": false, "dtype": "float32"}, "name": "block4-03_se_excite", "inbound_nodes": [[["block4-03_activation", 0, 0, {}], ["block4-03_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4-03_project_conv", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4-03_project_conv", "inbound_nodes": [[["block4-03_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block4-03_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block4-03_project_bn", "inbound_nodes": [[["block4-03_project_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "block4-03_drop", "trainable": false, "dtype": "float32", "rate": 0.06666666666666668, "noise_shape": [null, 1, 1, 1], "seed": null}, "name": "block4-03_drop", "inbound_nodes": [[["block4-03_project_bn", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "block4-03_add", "trainable": false, "dtype": "float32"}, "name": "block4-03_add", "inbound_nodes": [[["block4-03_drop", 0, 0, {}], ["block4-02_add", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-01_expand_conv", "trainable": false, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-01_expand_conv", "inbound_nodes": [[["block4-03_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5-01_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5-01_expand_bn", "inbound_nodes": [[["block5-01_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5-01_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block5-01_expand_activation", "inbound_nodes": [[["block5-01_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block5-01_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block5-01_dwconv2", "inbound_nodes": [[["block5-01_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5-01_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5-01_bn", "inbound_nodes": [[["block5-01_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5-01_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block5-01_activation", "inbound_nodes": [[["block5-01_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block5-01_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block5-01_se_squeeze", "inbound_nodes": [[["block5-01_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block5-01_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 576]}, "name": "block5-01_se_reshape", "inbound_nodes": [[["block5-01_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-01_se_reduce", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-01_se_reduce", "inbound_nodes": [[["block5-01_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-01_se_expand", "trainable": false, "dtype": "float32", "filters": 576, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-01_se_expand", "inbound_nodes": [[["block5-01_se_reduce", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "block5-01_se_excite", "trainable": false, "dtype": "float32"}, "name": "block5-01_se_excite", "inbound_nodes": [[["block5-01_activation", 0, 0, {}], ["block5-01_se_expand", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-01_project_conv", "trainable": false, "dtype": "float32", "filters": 112, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-01_project_conv", "inbound_nodes": [[["block5-01_se_excite", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5-01_project_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5-01_project_bn", "inbound_nodes": [[["block5-01_project_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-02_expand_conv", "trainable": false, "dtype": "float32", "filters": 672, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-02_expand_conv", "inbound_nodes": [[["block5-01_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5-02_expand_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5-02_expand_bn", "inbound_nodes": [[["block5-02_expand_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5-02_expand_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block5-02_expand_activation", "inbound_nodes": [[["block5-02_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "block5-02_dwconv2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block5-02_dwconv2", "inbound_nodes": [[["block5-02_expand_activation", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "block5-02_bn", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.9, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block5-02_bn", "inbound_nodes": [[["block5-02_dwconv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block5-02_activation", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "block5-02_activation", "inbound_nodes": [[["block5-02_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "block5-02_se_squeeze", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "block5-02_se_squeeze", "inbound_nodes": [[["block5-02_activation", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "block5-02_se_reshape", "trainable": false, "dtype": "float32", "target_shape": [1, 1, 672]}, "name": "block5-02_se_reshape", "inbound_nodes": [[["block5-02_se_squeeze", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-02_se_reduce", "trainable": false, "dtype": "float32", "filters": 28, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "swish", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5-02_se_reduce", "inbound_nodes": [[["block5-02_se_reshape", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5-02_se_expand", "trainable": false, "dtype": "float32", "filters": 672, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_out", "distribution": "truncated_normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", 